# 🚀 Infrastructure Review Report

## 📋 Terraform Plan Summary
```text
### Terraform Plan Summary
Terraform will perform the following actions:

  # aws_cloudwatch_log_group.app_logs will be created
  + resource "aws_cloudwatch_log_group" "app_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/myapp-dev/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Description" = "Application logs for ECS tasks"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-app-logs"
          + "Project"     = "myapp"
        }
      + tags_all          = {
          + "Description" = "Application logs for ECS tasks"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-app-logs"
          + "Project"     = "myapp"
        }
    }

  # aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for myapp dev"
      + id                      = (known after apply)
      + name                    = "myapp-dev-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-db-subnet-group"
          + "Project"     = "myapp"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-db-subnet-group"
          + "Project"     = "myapp"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecr_lifecycle_policy.main will be created
  + resource "aws_ecr_lifecycle_policy" "main" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "myapp-dev-ecr-web"
    }

  # aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "myapp-dev-ecr-web"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
```

## 💰 Infracost Estimate
_See Infracost comment or JSON artifact for details._

## 🧾 Diff Stats
```text
 .github/copilot-instructions.md                    |   8 +
 .github/instructions/copilot-code-review.md        |  93 +++
 .github/instructions/design.instructions.md        | 475 ---------------
 .github/instructions/spec.instructions.md          | 567 ------------------
 .github/instructions/terraform.instructions.md     | 593 ------------------
 .github/skills/README.md                           |  63 ++
 .github/skills/check-security/SKILL.md             |  31 +
 .github/skills/estimate-cost/SKILL.md              |  51 ++
 .github/skills/terraform-best-practices/SKILL.md   |  87 +++
 .../references/module-usage.md                     |  59 ++
 .../references/provider-selection.md               |  19 +
 .github/skills/terraform-coding-style/SKILL.md     | 222 +++++++
 .github/skills/verify-spec-compliance/SKILL.md     | 659 +++++++++++++++++++++
 .github/workflows/README.md                        |  80 +--
 .github/workflows/comprehensive-check.yml.backup   | 415 -------------
 .github/workflows/comprehensive-review.yml         | 130 ++++
 .github/workflows/copilot-hello.yml                |  35 ++
 .github/workflows/infracost.yml.backup             | 124 ----
 .github/workflows/terraform-apply-dr.yml.disabled  | 133 -----
 .github/workflows/terraform-plan-review.yml        | 481 ---------------
 .github/workflows/terraform-plan.yml.backup        | 240 --------
 README.md                                          |  88 +--
 scripts/gemini_cli.py                              |  62 ++
 scripts/generate_review.sh                         | 108 ++++
 terraform/aws/main.tf                              |  15 +
 terraform/aws/variables.tf                         |   1 +
 26 files changed, 1696 insertions(+), 3143 deletions(-)
```
